Tekla.Structures.CatalogInternal.ShapeLocation
Location of shape data on the disk.
NOTE: If shape originates from non-Model location,
once it used in the user model the shape data will be copied and located also in the Model folder.

Tekla.Structures.CatalogInternal.ShapeLocation.Error
Shape location information is not found

Tekla.Structures.CatalogInternal.ShapeLocation.Model
Shape data is located in the model folder

Tekla.Structures.CatalogInternal.ShapeLocation.System
Shape data is located in XS_SYSTEM folders

Tekla.Structures.CatalogInternal.ShapeLocation.Project
Shape data is located in XS_PROJECT folders

Tekla.Structures.CatalogInternal.ShapeLocation.Firm
Shape data is located in XS_FIRM folders

Tekla.Structures.CatalogInternal.ShapeLocation.DefaultBrepPath
Shape data is located in XS_DEFAULT_BREP_PATH folder